app/controllers/articles_controller.rb

  def update
    set_article
    @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-08-13 18:57:14.056311"], ["id", 1]]